data/2023_08_22/read_write_split_enable_8_with_read_pct_80/test-vtgate-run-80-20-75-time-2023-08-23-11-10.txt
run sysbench
check mysql database exists
mysql host 172.16.251.240 connect success!
database mydb exists
/usr/bin/sysbench
cd ./sysbench/src/lua;sysbench --db-driver=mysql --mysql-host=172.16.251.240 --mysql-port=15306 --mysql-user=root --mysql-password=123456 --mysql-db=mydb --table_size=2000000 --tables=50 --time=60 --threads=75 --events=0 --percentile=99 --read-percent=80 --write-percent=20 --skip_trx=on --mysql-ignore-errors=1062 --db-ps-mode=disable --report-interval=1 oltp_read_write_pct run
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 75
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 75 tps: 149.80 qps: 15814.94 (r/w/o: 12818.93/2996.01/0.00) lat (ms,99%): 502.20 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 75 tps: 85.04 qps: 13772.19 (r/w/o: 11647.08/2125.11/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 75 tps: 157.00 qps: 13778.22 (r/w/o: 11028.18/2750.04/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 75 tps: 146.00 qps: 12507.94 (r/w/o: 9484.95/3022.98/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 75 tps: 98.00 qps: 13972.03 (r/w/o: 11534.02/2438.00/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 75 tps: 122.00 qps: 9120.99 (r/w/o: 6829.99/2291.00/0.00) lat (ms,99%): 893.56 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 75 tps: 109.00 qps: 13655.96 (r/w/o: 11703.97/1951.99/0.00) lat (ms,99%): 943.16 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 75 tps: 155.00 qps: 13030.01 (r/w/o: 10093.01/2937.00/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 75 tps: 150.00 qps: 14600.16 (r/w/o: 11477.12/3123.03/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 75 tps: 123.00 qps: 14730.87 (r/w/o: 11997.89/2732.98/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 75 tps: 153.00 qps: 14966.00 (r/w/o: 12105.00/2861.00/0.00) lat (ms,99%): 549.52 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 75 tps: 159.00 qps: 13795.98 (r/w/o: 10817.98/2977.99/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 75 tps: 118.00 qps: 14064.05 (r/w/o: 11110.04/2954.01/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 75 tps: 146.00 qps: 14963.05 (r/w/o: 12308.04/2655.01/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 75 tps: 155.00 qps: 14203.88 (r/w/o: 11409.90/2793.98/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 75 tps: 151.00 qps: 14301.96 (r/w/o: 11220.97/3080.99/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 75 tps: 137.00 qps: 14611.10 (r/w/o: 11650.08/2961.02/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 75 tps: 145.00 qps: 14763.05 (r/w/o: 11872.04/2891.01/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 75 tps: 142.92 qps: 13690.72 (r/w/o: 11087.10/2603.61/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 75 tps: 145.08 qps: 13938.22 (r/w/o: 10880.64/3057.58/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 75 tps: 119.00 qps: 14202.24 (r/w/o: 11509.20/2693.05/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 75 tps: 151.00 qps: 14448.66 (r/w/o: 11794.73/2653.94/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 75 tps: 155.00 qps: 13571.06 (r/w/o: 10598.05/2973.01/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 75 tps: 116.00 qps: 13623.12 (r/w/o: 10796.09/2827.02/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 75 tps: 146.00 qps: 14511.91 (r/w/o: 11991.93/2519.98/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 75 tps: 154.00 qps: 12899.15 (r/w/o: 9928.11/2971.03/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 75 tps: 107.00 qps: 13825.78 (r/w/o: 11203.82/2621.96/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 75 tps: 146.99 qps: 13452.41 (r/w/o: 10942.52/2509.89/0.00) lat (ms,99%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 75 tps: 148.01 qps: 13496.72 (r/w/o: 10416.55/3080.16/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 75 tps: 108.00 qps: 13766.10 (r/w/o: 11311.08/2455.02/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 75 tps: 153.00 qps: 12643.78 (r/w/o: 10068.83/2574.96/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 75 tps: 94.00 qps: 12277.23 (r/w/o: 9678.18/2599.05/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 75 tps: 149.00 qps: 12395.59 (r/w/o: 10159.66/2235.93/0.00) lat (ms,99%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 75 tps: 152.00 qps: 12962.14 (r/w/o: 9879.11/3083.03/0.00) lat (ms,99%): 746.32 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 75 tps: 92.00 qps: 13515.26 (r/w/o: 11164.21/2351.04/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 75 tps: 152.00 qps: 12910.99 (r/w/o: 10437.99/2473.00/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 75 tps: 144.00 qps: 13175.76 (r/w/o: 10130.82/3044.95/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 75 tps: 112.00 qps: 14039.26 (r/w/o: 11731.22/2308.04/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 75 tps: 151.92 qps: 13296.15 (r/w/o: 10468.60/2827.54/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 75 tps: 110.06 qps: 12719.79 (r/w/o: 9958.32/2761.47/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 75 tps: 145.00 qps: 14097.60 (r/w/o: 11653.67/2443.93/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 75 tps: 153.00 qps: 13531.08 (r/w/o: 10492.07/3039.02/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 75 tps: 117.00 qps: 14044.07 (r/w/o: 11373.06/2671.01/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 75 tps: 151.00 qps: 14324.65 (r/w/o: 11601.72/2722.93/0.00) lat (ms,99%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 75 tps: 154.00 qps: 13444.27 (r/w/o: 10470.21/2974.06/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 75 tps: 94.00 qps: 12818.08 (r/w/o: 10403.07/2415.02/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 75 tps: 150.99 qps: 13533.45 (r/w/o: 11069.55/2463.90/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 75 tps: 151.01 qps: 13066.48 (r/w/o: 10006.37/3060.11/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 75 tps: 104.00 qps: 13677.04 (r/w/o: 11030.03/2647.01/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 75 tps: 151.00 qps: 14178.82 (r/w/o: 11646.85/2531.97/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 75 tps: 155.00 qps: 14198.13 (r/w/o: 11129.10/3069.03/0.00) lat (ms,99%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 75 tps: 141.00 qps: 13989.92 (r/w/o: 10949.94/3039.98/0.00) lat (ms,99%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 75 tps: 128.00 qps: 14430.07 (r/w/o: 11744.06/2686.01/0.00) lat (ms,99%): 580.02 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 75 tps: 144.96 qps: 14431.92 (r/w/o: 11844.65/2587.27/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 75 tps: 153.04 qps: 13223.67 (r/w/o: 10234.84/2988.83/0.00) lat (ms,99%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 75 tps: 101.00 qps: 13405.88 (r/w/o: 10979.90/2425.98/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 75 tps: 155.00 qps: 13403.19 (r/w/o: 10758.15/2645.04/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 75 tps: 128.00 qps: 12238.96 (r/w/o: 9242.97/2995.99/0.00) lat (ms,99%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 75 tps: 120.00 qps: 13456.87 (r/w/o: 11487.89/1968.98/0.00) lat (ms,99%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 75 tps: 150.00 qps: 12614.95 (r/w/o: 9589.96/3024.99/0.00) lat (ms,99%): 646.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            658400
        write:                           164600
        other:                           0
        total:                           823000
    transactions:                        8230   (136.10 per sec.)
    queries:                             823000 (13610.37 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.4679s
    total number of events:              8230

Latency (ms):
         min:                                  299.34
         avg:                                  550.09
         max:                                 1059.57
         99th percentile:                      719.92
         sum:                              4527251.44

Threads fairness:
    events (avg/stddev):           109.7333/1.20
    execution time (avg/stddev):   60.3634/0.11